%画图  准确率随迭代次数的关系
clc
clear

y1=[64,70,77,90,86,91,85,92,92,90,94,94,95,93,91,92,92,93,94,95];
y2=[60,67,70,87,79,86,86,87,87,90,88,88,87,92,91,91,91,92,92,92];
y3=[60,64,77,90,87,86,90,89,90,91,88,90,93,91,91,90,89,91,90,90];
y4=[50,55,71,86,84,86,88,86,87,82,81,83,86,87,85,85,88,87,88,87];
x=100:100:2000;

plot(x,y1,'linewidth',1.5)
hold on
plot(x,y2,'r--','linewidth',1.5)
plot(x,y3,'k:','linewidth',1.5)
plot(x,y4,'m-.','linewidth',1.5)
legend('R-STDP训练集分类结果','R-STDP测试集分类结果','STDP训练集分类结果','STDP测试集分类结果','location','East');
grid on
title('数据集分类准确度随迭代次数变化关系')
ylabel('准确度')
xlabel('迭代次数')
axis([0,2100,50,100])